In [1]:
# !wget https://raw.githubusercontent.com/Yorko/mlcourse.ai/main/data/titanic_train.csv --output-document=./titanic_train.csv

In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('/home/volodya/my_rep/course/data/titanic_train.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Расшифровка признаков:

    Номинативные (качественные):
- **Sex** - Пол пассажира
- **Embarked** - Порт посадки пассажира (S - Саутгемптон, C - Шербург и Q - Куинстаун)
- **Pclass*** - Класс билета (1 - высший, 2 - средний, 3 - низший)

    Числовые:
- **Age** - Возраст пассажира
- **Fare** - Стоимость билета
- **SibSp** - Число братьев, сестер или супругов на борту у пассажира
- **Parch** - Число родителей или детей, с которыми путешествовал каждый пассажир 
- **Ticket*** - Номер билета
- **Cabin*** - Номер кабины

    Текстовые:
- **Name** - Имя пассажира

    Таргет:
- **Survived** - Выжил ли пассажир (1 - да, 0 - нет)

# Задание

Вопросы:

1. Постройте гистограмму распределения возвраста с шириной бинов в 5 лет. Укажите количество элементов на каждом столбике гистограммы.
2. Постройте боксплот распределения возвраста. Укажите на нём среднее. 
3. Постройте скрипка-плот распределения возвраста. Укажите на нём среднее и медиану. 

Вопросы:

1. Сколько мужчин / женщин находилось на борту?
2. Выведите распределение переменной `Pclass` c `sns.countplot`
3. Выведите распределение переменной `Pclass` c `sns.countplot` для мужчин / женщин по отдельности. <br>— Сколько было мужчин 2-го класса? <br> — Укажите значения на каждом столбике.
4. Каковы медиана, стандартное отклонение, 25 и 75-% квартили платежей (`Fare`)?
5. Сравните распределение стоимости билетов у вышивших и погибших. У кого больше средняя стоимость билета?
6. Правда ли, что люди моложе 30 лет выживали чаще, чем люди старше 60 лет? Каковы доли выживших в обеих группах?
7. Правда ли, что женщины выживали чаще мужчин? Каковы доли выживших в обеих группах?
8. Правда ли, что пассажиры 1 класса выживали чаще пассажиров 2 и 3 классов. Каковы доли выживших в группах `PClass`.
8. Как отличается средний возраст мужчин / женщин в зависимости от класса обслуживания?
9. Найдите самое популярное имя среди пассажиров Титаника мужского пола?

In [2]:
import pandas as pd
pd.DataFrame({'id': [1,2,3,4], 'labels': [[0, 2], [1], [2,3], [3]]})

   id  labels
0   1  [0, 2]
1   2     [1]
2   3  [2, 3]
3   4     [3]